GopalSaraf/Practicals/PSDL/include/proc/pic18f26k80.inc
// Register: CANCON_RO0
#define CANCON_RO0 CANCON_RO0
CANCON_RO0                               equ 0F3Fh
// bitfield definitions
CANCON_RO0_FP0_POSN                      equ 0000h
CANCON_RO0_FP0_POSITION                  equ 0000h
CANCON_RO0_FP0_SIZE                      equ 0001h
CANCON_RO0_FP0_LENGTH                    equ 0001h
CANCON_RO0_FP0_MASK                      equ 0001h
CANCON_RO0_WIN0_FP1_POSN                 equ 0001h
CANCON_RO0_WIN0_FP1_POSITION             equ 0001h
CANCON_RO0_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO0_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO0_WIN0_FP1_MASK                 equ 0002h
CANCON_RO0_WIN1_FP2_POSN                 equ 0002h
CANCON_RO0_WIN1_FP2_POSITION             equ 0002h
CANCON_RO0_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO0_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO0_WIN1_FP2_MASK                 equ 0004h
CANCON_RO0_WIN2_FP3_POSN                 equ 0003h
CANCON_RO0_WIN2_FP3_POSITION             equ 0003h
CANCON_RO0_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO0_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO0_WIN2_FP3_MASK                 equ 0008h
CANCON_RO0_ABAT_POSN                     equ 0004h
CANCON_RO0_ABAT_POSITION                 equ 0004h
CANCON_RO0_ABAT_SIZE                     equ 0001h
CANCON_RO0_ABAT_LENGTH                   equ 0001h
CANCON_RO0_ABAT_MASK                     equ 0010h
CANCON_RO0_REQOP_POSN                    equ 0005h
CANCON_RO0_REQOP_POSITION                equ 0005h
CANCON_RO0_REQOP_SIZE                    equ 0003h
CANCON_RO0_REQOP_LENGTH                  equ 0003h
CANCON_RO0_REQOP_MASK                    equ 00E0h
CANCON_RO0_WIN0_POSN                     equ 0001h
CANCON_RO0_WIN0_POSITION                 equ 0001h
CANCON_RO0_WIN0_SIZE                     equ 0001h
CANCON_RO0_WIN0_LENGTH                   equ 0001h
CANCON_RO0_WIN0_MASK                     equ 0002h
CANCON_RO0_WIN1_POSN                     equ 0002h
CANCON_RO0_WIN1_POSITION                 equ 0002h
CANCON_RO0_WIN1_SIZE                     equ 0001h
CANCON_RO0_WIN1_LENGTH                   equ 0001h
CANCON_RO0_WIN1_MASK                     equ 0004h
CANCON_RO0_WIN2_POSN                     equ 0003h
CANCON_RO0_WIN2_POSITION                 equ 0003h
CANCON_RO0_WIN2_SIZE                     equ 0001h
CANCON_RO0_WIN2_LENGTH                   equ 0001h
CANCON_RO0_WIN2_MASK                     equ 0008h
CANCON_RO0_FP1_POSN                      equ 0001h
CANCON_RO0_FP1_POSITION                  equ 0001h
CANCON_RO0_FP1_SIZE                      equ 0001h
CANCON_RO0_FP1_LENGTH                    equ 0001h
CANCON_RO0_FP1_MASK                      equ 0002h
CANCON_RO0_FP2_POSN                      equ 0002h
CANCON_RO0_FP2_POSITION                  equ 0002h
CANCON_RO0_FP2_SIZE                      equ 0001h
CANCON_RO0_FP2_LENGTH                    equ 0001h
CANCON_RO0_FP2_MASK                      equ 0004h
CANCON_RO0_FP3_POSN                      equ 0003h
CANCON_RO0_FP3_POSITION                  equ 0003h
CANCON_RO0_FP3_SIZE                      equ 0001h
CANCON_RO0_FP3_LENGTH                    equ 0001h
CANCON_RO0_FP3_MASK                      equ 0008h

// Register: CCP5CON
#define CCP5CON CCP5CON
CCP5CON                                  equ 0F47h
// bitfield definitions
CCP5CON_CCP5M_POSN                       equ 0000h
CCP5CON_CCP5M_POSITION                   equ 0000h
CCP5CON_CCP5M_SIZE                       equ 0004h
CCP5CON_CCP5M_LENGTH                     equ 0004h
CCP5CON_CCP5M_MASK                       equ 000Fh
CCP5CON_DC5B_POSN                        equ 0004h
CCP5CON_DC5B_POSITION                    equ 0004h
CCP5CON_DC5B_SIZE                        equ 0002h
CCP5CON_DC5B_LENGTH                      equ 0002h
CCP5CON_DC5B_MASK                        equ 0030h
CCP5CON_CCP5M0_POSN                      equ 0000h
CCP5CON_CCP5M0_POSITION                  equ 0000h
CCP5CON_CCP5M0_SIZE                      equ 0001h
CCP5CON_CCP5M0_LENGTH                    equ 0001h
CCP5CON_CCP5M0_MASK                      equ 0001h
CCP5CON_CCP5M1_POSN                      equ 0001h
CCP5CON_CCP5M1_POSITION                  equ 0001h
CCP5CON_CCP5M1_SIZE                      equ 0001h
CCP5CON_CCP5M1_LENGTH                    equ 0001h
CCP5CON_CCP5M1_MASK                      equ 0002h
CCP5CON_CCP5M2_POSN                      equ 0002h
CCP5CON_CCP5M2_POSITION                  equ 0002h
CCP5CON_CCP5M2_SIZE                      equ 0001h
CCP5CON_CCP5M2_LENGTH                    equ 0001h
CCP5CON_CCP5M2_MASK                      equ 0004h
CCP5CON_CCP5M3_POSN                      equ 0003h
CCP5CON_CCP5M3_POSITION                  equ 0003h
CCP5CON_CCP5M3_SIZE                      equ 0001h
CCP5CON_CCP5M3_LENGTH                    equ 0001h
CCP5CON_CCP5M3_MASK                      equ 0008h
CCP5CON_DC5B0_POSN                       equ 0004h
CCP5CON_DC5B0_POSITION                   equ 0004h
CCP5CON_DC5B0_SIZE                       equ 0001h
CCP5CON_DC5B0_LENGTH                     equ 0001h
CCP5CON_DC5B0_MASK                       equ 0010h
CCP5CON_DC5B1_POSN                       equ 0005h
CCP5CON_DC5B1_POSITION                   equ 0005h
CCP5CON_DC5B1_SIZE                       equ 0001h
CCP5CON_DC5B1_LENGTH                     equ 0001h
CCP5CON_DC5B1_MASK                       equ 0020h
CCP5CON_CCP5Y_POSN                       equ 0004h
CCP5CON_CCP5Y_POSITION                   equ 0004h
CCP5CON_CCP5Y_SIZE                       equ 0001h
CCP5CON_CCP5Y_LENGTH                     equ 0001h
CCP5CON_CCP5Y_MASK                       equ 0010h
CCP5CON_CCP5X_POSN                       equ 0005h
CCP5CON_CCP5X_POSITION                   equ 0005h
CCP5CON_CCP5X_SIZE                       equ 0001h
CCP5CON_CCP5X_LENGTH                     equ 0001h
CCP5CON_CCP5X_MASK                       equ 0020h

// Register: CCPR5
#define CCPR5 CCPR5
CCPR5                                    equ 0F48h

// Register: CCPR5L
#define CCPR5L CCPR5L
CCPR5L                                   equ 0F48h
// bitfield definitions
CCPR5L_CCPR5L_POSN                       equ 0000h
CCPR5L_CCPR5L_POSITION                   equ 0000h
CCPR5L_CCPR5L_SIZE                       equ 0008h
CCPR5L_CCPR5L_LENGTH                     equ 0008h
CCPR5L_CCPR5L_MASK                       equ 00FFh

// Register: CCPR5H
#define CCPR5H CCPR5H
CCPR5H                                   equ 0F49h
// bitfield definitions
CCPR5H_CCPR5H_POSN                       equ 0000h
CCPR5H_CCPR5H_POSITION                   equ 0000h
CCPR5H_CCPR5H_SIZE                       equ 0008h
CCPR5H_CCPR5H_LENGTH                     equ 0008h
CCPR5H_CCPR5H_MASK                       equ 00FFh

// Register: CCP4CON
#define CCP4CON CCP4CON
CCP4CON                                  equ 0F4Ah
// bitfield definitions
CCP4CON_CCP4M_POSN                       equ 0000h
CCP4CON_CCP4M_POSITION                   equ 0000h
CCP4CON_CCP4M_SIZE                       equ 0004h
CCP4CON_CCP4M_LENGTH                     equ 0004h
CCP4CON_CCP4M_MASK                       equ 000Fh
CCP4CON_DC4B_POSN                        equ 0004h
CCP4CON_DC4B_POSITION                    equ 0004h
CCP4CON_DC4B_SIZE                        equ 0002h
CCP4CON_DC4B_LENGTH                      equ 0002h
CCP4CON_DC4B_MASK                        equ 0030h
CCP4CON_CCP4M0_POSN                      equ 0000h
CCP4CON_CCP4M0_POSITION                  equ 0000h
CCP4CON_CCP4M0_SIZE                      equ 0001h
CCP4CON_CCP4M0_LENGTH                    equ 0001h
CCP4CON_CCP4M0_MASK                      equ 0001h
CCP4CON_CCP4M1_POSN                      equ 0001h
CCP4CON_CCP4M1_POSITION                  equ 0001h
CCP4CON_CCP4M1_SIZE                      equ 0001h
CCP4CON_CCP4M1_LENGTH                    equ 0001h
CCP4CON_CCP4M1_MASK                      equ 0002h
CCP4CON_CCP4M2_POSN                      equ 0002h
CCP4CON_CCP4M2_POSITION                  equ 0002h
CCP4CON_CCP4M2_SIZE                      equ 0001h
CCP4CON_CCP4M2_LENGTH                    equ 0001h
CCP4CON_CCP4M2_MASK                      equ 0004h
CCP4CON_CCP4M3_POSN                      equ 0003h
CCP4CON_CCP4M3_POSITION                  equ 0003h
CCP4CON_CCP4M3_SIZE                      equ 0001h
CCP4CON_CCP4M3_LENGTH                    equ 0001h
CCP4CON_CCP4M3_MASK                      equ 0008h
CCP4CON_DC4B0_POSN                       equ 0004h
CCP4CON_DC4B0_POSITION                   equ 0004h
CCP4CON_DC4B0_SIZE                       equ 0001h
CCP4CON_DC4B0_LENGTH                     equ 0001h
CCP4CON_DC4B0_MASK                       equ 0010h
CCP4CON_DC4B1_POSN                       equ 0005h
CCP4CON_DC4B1_POSITION                   equ 0005h
CCP4CON_DC4B1_SIZE                       equ 0001h
CCP4CON_DC4B1_LENGTH                     equ 0001h
CCP4CON_DC4B1_MASK                       equ 0020h
CCP4CON_CCP4Y_POSN                       equ 0004h
CCP4CON_CCP4Y_POSITION                   equ 0004h
CCP4CON_CCP4Y_SIZE                       equ 0001h
CCP4CON_CCP4Y_LENGTH                     equ 0001h
CCP4CON_CCP4Y_MASK                       equ 0010h
CCP4CON_CCP4X_POSN                       equ 0005h
CCP4CON_CCP4X_POSITION                   equ 0005h
CCP4CON_CCP4X_SIZE                       equ 0001h
CCP4CON_CCP4X_LENGTH                     equ 0001h
CCP4CON_CCP4X_MASK                       equ 0020h

// Register: CCPR4
#define CCPR4 CCPR4
CCPR4                                    equ 0F4Bh

// Register: CCPR4L
#define CCPR4L CCPR4L
CCPR4L                                   equ 0F4Bh
// bitfield definitions
CCPR4L_CCPR4L_POSN                       equ 0000h
CCPR4L_CCPR4L_POSITION                   equ 0000h
CCPR4L_CCPR4L_SIZE                       equ 0008h
CCPR4L_CCPR4L_LENGTH                     equ 0008h
CCPR4L_CCPR4L_MASK                       equ 00FFh

// Register: CCPR4H
#define CCPR4H CCPR4H
CCPR4H                                   equ 0F4Ch
// bitfield definitions
CCPR4H_CCPR4H_POSN                       equ 0000h
CCPR4H_CCPR4H_POSITION                   equ 0000h
CCPR4H_CCPR4H_SIZE                       equ 0008h
CCPR4H_CCPR4H_LENGTH                     equ 0008h
CCPR4H_CCPR4H_MASK                       equ 00FFh

