GopalSaraf/Practicals/PSDL/include/proc/pic18f26k80.inc
// Register: IOCB
#define IOCB IOCB
IOCB                                     equ 0F5Ah
// bitfield definitions
IOCB_IOCB4_POSN                          equ 0004h
IOCB_IOCB4_POSITION                      equ 0004h
IOCB_IOCB4_SIZE                          equ 0001h
IOCB_IOCB4_LENGTH                        equ 0001h
IOCB_IOCB4_MASK                          equ 0010h
IOCB_IOCB5_POSN                          equ 0005h
IOCB_IOCB5_POSITION                      equ 0005h
IOCB_IOCB5_SIZE                          equ 0001h
IOCB_IOCB5_LENGTH                        equ 0001h
IOCB_IOCB5_MASK                          equ 0020h
IOCB_IOCB6_POSN                          equ 0006h
IOCB_IOCB6_POSITION                      equ 0006h
IOCB_IOCB6_SIZE                          equ 0001h
IOCB_IOCB6_LENGTH                        equ 0001h
IOCB_IOCB6_MASK                          equ 0040h
IOCB_IOCB7_POSN                          equ 0007h
IOCB_IOCB7_POSITION                      equ 0007h
IOCB_IOCB7_SIZE                          equ 0001h
IOCB_IOCB7_LENGTH                        equ 0001h
IOCB_IOCB7_MASK                          equ 0080h

// Register: WPUB
#define WPUB WPUB
WPUB                                     equ 0F5Bh
// bitfield definitions
WPUB_WPUB0_POSN                          equ 0000h
WPUB_WPUB0_POSITION                      equ 0000h
WPUB_WPUB0_SIZE                          equ 0001h
WPUB_WPUB0_LENGTH                        equ 0001h
WPUB_WPUB0_MASK                          equ 0001h
WPUB_WPUB1_POSN                          equ 0001h
WPUB_WPUB1_POSITION                      equ 0001h
WPUB_WPUB1_SIZE                          equ 0001h
WPUB_WPUB1_LENGTH                        equ 0001h
WPUB_WPUB1_MASK                          equ 0002h
WPUB_WPUB2_POSN                          equ 0002h
WPUB_WPUB2_POSITION                      equ 0002h
WPUB_WPUB2_SIZE                          equ 0001h
WPUB_WPUB2_LENGTH                        equ 0001h
WPUB_WPUB2_MASK                          equ 0004h
WPUB_WPUB3_POSN                          equ 0003h
WPUB_WPUB3_POSITION                      equ 0003h
WPUB_WPUB3_SIZE                          equ 0001h
WPUB_WPUB3_LENGTH                        equ 0001h
WPUB_WPUB3_MASK                          equ 0008h
WPUB_WPUB4_POSN                          equ 0004h
WPUB_WPUB4_POSITION                      equ 0004h
WPUB_WPUB4_SIZE                          equ 0001h
WPUB_WPUB4_LENGTH                        equ 0001h
WPUB_WPUB4_MASK                          equ 0010h
WPUB_WPUB5_POSN                          equ 0005h
WPUB_WPUB5_POSITION                      equ 0005h
WPUB_WPUB5_SIZE                          equ 0001h
WPUB_WPUB5_LENGTH                        equ 0001h
WPUB_WPUB5_MASK                          equ 0020h
WPUB_WPUB6_POSN                          equ 0006h
WPUB_WPUB6_POSITION                      equ 0006h
WPUB_WPUB6_SIZE                          equ 0001h
WPUB_WPUB6_LENGTH                        equ 0001h
WPUB_WPUB6_MASK                          equ 0040h
WPUB_WPUB7_POSN                          equ 0007h
WPUB_WPUB7_POSITION                      equ 0007h
WPUB_WPUB7_SIZE                          equ 0001h
WPUB_WPUB7_LENGTH                        equ 0001h
WPUB_WPUB7_MASK                          equ 0080h

// Register: ANCON1
#define ANCON1 ANCON1
ANCON1                                   equ 0F5Ch
// bitfield definitions
ANCON1_ANSEL8_POSN                       equ 0000h
ANCON1_ANSEL8_POSITION                   equ 0000h
ANCON1_ANSEL8_SIZE                       equ 0001h
ANCON1_ANSEL8_LENGTH                     equ 0001h
ANCON1_ANSEL8_MASK                       equ 0001h
ANCON1_ANSEL9_POSN                       equ 0001h
ANCON1_ANSEL9_POSITION                   equ 0001h
ANCON1_ANSEL9_SIZE                       equ 0001h
ANCON1_ANSEL9_LENGTH                     equ 0001h
ANCON1_ANSEL9_MASK                       equ 0002h
ANCON1_ANSEL10_POSN                      equ 0002h
ANCON1_ANSEL10_POSITION                  equ 0002h
ANCON1_ANSEL10_SIZE                      equ 0001h
ANCON1_ANSEL10_LENGTH                    equ 0001h
ANCON1_ANSEL10_MASK                      equ 0004h
ANCON1_PCFG8_POSN                        equ 0000h
ANCON1_PCFG8_POSITION                    equ 0000h
ANCON1_PCFG8_SIZE                        equ 0001h
ANCON1_PCFG8_LENGTH                      equ 0001h
ANCON1_PCFG8_MASK                        equ 0001h
ANCON1_PCFG9_POSN                        equ 0001h
ANCON1_PCFG9_POSITION                    equ 0001h
ANCON1_PCFG9_SIZE                        equ 0001h
ANCON1_PCFG9_LENGTH                      equ 0001h
ANCON1_PCFG9_MASK                        equ 0002h
ANCON1_PCFG10_POSN                       equ 0002h
ANCON1_PCFG10_POSITION                   equ 0002h
ANCON1_PCFG10_SIZE                       equ 0001h
ANCON1_PCFG10_LENGTH                     equ 0001h
ANCON1_PCFG10_MASK                       equ 0004h

// Register: ANCON0
#define ANCON0 ANCON0
ANCON0                                   equ 0F5Dh
// bitfield definitions
ANCON0_ANSEL0_POSN                       equ 0000h
ANCON0_ANSEL0_POSITION                   equ 0000h
ANCON0_ANSEL0_SIZE                       equ 0001h
ANCON0_ANSEL0_LENGTH                     equ 0001h
ANCON0_ANSEL0_MASK                       equ 0001h
ANCON0_ANSEL1_POSN                       equ 0001h
ANCON0_ANSEL1_POSITION                   equ 0001h
ANCON0_ANSEL1_SIZE                       equ 0001h
ANCON0_ANSEL1_LENGTH                     equ 0001h
ANCON0_ANSEL1_MASK                       equ 0002h
ANCON0_ANSEL2_POSN                       equ 0002h
ANCON0_ANSEL2_POSITION                   equ 0002h
ANCON0_ANSEL2_SIZE                       equ 0001h
ANCON0_ANSEL2_LENGTH                     equ 0001h
ANCON0_ANSEL2_MASK                       equ 0004h
ANCON0_ANSEL3_POSN                       equ 0003h
ANCON0_ANSEL3_POSITION                   equ 0003h
ANCON0_ANSEL3_SIZE                       equ 0001h
ANCON0_ANSEL3_LENGTH                     equ 0001h
ANCON0_ANSEL3_MASK                       equ 0008h
ANCON0_ANSEL4_POSN                       equ 0004h
ANCON0_ANSEL4_POSITION                   equ 0004h
ANCON0_ANSEL4_SIZE                       equ 0001h
ANCON0_ANSEL4_LENGTH                     equ 0001h
ANCON0_ANSEL4_MASK                       equ 0010h
ANCON0_PCFG0_POSN                        equ 0000h
ANCON0_PCFG0_POSITION                    equ 0000h
ANCON0_PCFG0_SIZE                        equ 0001h
ANCON0_PCFG0_LENGTH                      equ 0001h
ANCON0_PCFG0_MASK                        equ 0001h
ANCON0_PCFG1_POSN                        equ 0001h
ANCON0_PCFG1_POSITION                    equ 0001h
ANCON0_PCFG1_SIZE                        equ 0001h
ANCON0_PCFG1_LENGTH                      equ 0001h
ANCON0_PCFG1_MASK                        equ 0002h
ANCON0_PCFG2_POSN                        equ 0002h
ANCON0_PCFG2_POSITION                    equ 0002h
ANCON0_PCFG2_SIZE                        equ 0001h
ANCON0_PCFG2_LENGTH                      equ 0001h
ANCON0_PCFG2_MASK                        equ 0004h
ANCON0_PCFG3_POSN                        equ 0003h
ANCON0_PCFG3_POSITION                    equ 0003h
ANCON0_PCFG3_SIZE                        equ 0001h
ANCON0_PCFG3_LENGTH                      equ 0001h
ANCON0_PCFG3_MASK                        equ 0008h
ANCON0_PCFG4_POSN                        equ 0004h
ANCON0_PCFG4_POSITION                    equ 0004h
ANCON0_PCFG4_SIZE                        equ 0001h
ANCON0_PCFG4_LENGTH                      equ 0001h
ANCON0_PCFG4_MASK                        equ 0010h

