GopalSaraf/Practicals/PSDL/include/proc/pic18f26k80.inc
// Register: LATC
#define LATC LATC
LATC                                     equ 0F8Bh
// bitfield definitions
LATC_LATC0_POSN                          equ 0000h
LATC_LATC0_POSITION                      equ 0000h
LATC_LATC0_SIZE                          equ 0001h
LATC_LATC0_LENGTH                        equ 0001h
LATC_LATC0_MASK                          equ 0001h
LATC_LATC1_POSN                          equ 0001h
LATC_LATC1_POSITION                      equ 0001h
LATC_LATC1_SIZE                          equ 0001h
LATC_LATC1_LENGTH                        equ 0001h
LATC_LATC1_MASK                          equ 0002h
LATC_LATC2_POSN                          equ 0002h
LATC_LATC2_POSITION                      equ 0002h
LATC_LATC2_SIZE                          equ 0001h
LATC_LATC2_LENGTH                        equ 0001h
LATC_LATC2_MASK                          equ 0004h
LATC_LATC3_POSN                          equ 0003h
LATC_LATC3_POSITION                      equ 0003h
LATC_LATC3_SIZE                          equ 0001h
LATC_LATC3_LENGTH                        equ 0001h
LATC_LATC3_MASK                          equ 0008h
LATC_LATC4_POSN                          equ 0004h
LATC_LATC4_POSITION                      equ 0004h
LATC_LATC4_SIZE                          equ 0001h
LATC_LATC4_LENGTH                        equ 0001h
LATC_LATC4_MASK                          equ 0010h
LATC_LATC5_POSN                          equ 0005h
LATC_LATC5_POSITION                      equ 0005h
LATC_LATC5_SIZE                          equ 0001h
LATC_LATC5_LENGTH                        equ 0001h
LATC_LATC5_MASK                          equ 0020h
LATC_LATC6_POSN                          equ 0006h
LATC_LATC6_POSITION                      equ 0006h
LATC_LATC6_SIZE                          equ 0001h
LATC_LATC6_LENGTH                        equ 0001h
LATC_LATC6_MASK                          equ 0040h
LATC_LATC7_POSN                          equ 0007h
LATC_LATC7_POSITION                      equ 0007h
LATC_LATC7_SIZE                          equ 0001h
LATC_LATC7_LENGTH                        equ 0001h
LATC_LATC7_MASK                          equ 0080h
LATC_LC0_POSN                            equ 0000h
LATC_LC0_POSITION                        equ 0000h
LATC_LC0_SIZE                            equ 0001h
LATC_LC0_LENGTH                          equ 0001h
LATC_LC0_MASK                            equ 0001h
LATC_LC1_POSN                            equ 0001h
LATC_LC1_POSITION                        equ 0001h
LATC_LC1_SIZE                            equ 0001h
LATC_LC1_LENGTH                          equ 0001h
LATC_LC1_MASK                            equ 0002h
LATC_LC2_POSN                            equ 0002h
LATC_LC2_POSITION                        equ 0002h
LATC_LC2_SIZE                            equ 0001h
LATC_LC2_LENGTH                          equ 0001h
LATC_LC2_MASK                            equ 0004h
LATC_LC3_POSN                            equ 0003h
LATC_LC3_POSITION                        equ 0003h
LATC_LC3_SIZE                            equ 0001h
LATC_LC3_LENGTH                          equ 0001h
LATC_LC3_MASK                            equ 0008h
LATC_LC4_POSN                            equ 0004h
LATC_LC4_POSITION                        equ 0004h
LATC_LC4_SIZE                            equ 0001h
LATC_LC4_LENGTH                          equ 0001h
LATC_LC4_MASK                            equ 0010h
LATC_LC5_POSN                            equ 0005h
LATC_LC5_POSITION                        equ 0005h
LATC_LC5_SIZE                            equ 0001h
LATC_LC5_LENGTH                          equ 0001h
LATC_LC5_MASK                            equ 0020h
LATC_LC6_POSN                            equ 0006h
LATC_LC6_POSITION                        equ 0006h
LATC_LC6_SIZE                            equ 0001h
LATC_LC6_LENGTH                          equ 0001h
LATC_LC6_MASK                            equ 0040h
LATC_LC7_POSN                            equ 0007h
LATC_LC7_POSITION                        equ 0007h
LATC_LC7_SIZE                            equ 0001h
LATC_LC7_LENGTH                          equ 0001h
LATC_LC7_MASK                            equ 0080h

// Register: SLRCON
#define SLRCON SLRCON
SLRCON                                   equ 0F90h
// bitfield definitions
SLRCON_SLRA_POSN                         equ 0000h
SLRCON_SLRA_POSITION                     equ 0000h
SLRCON_SLRA_SIZE                         equ 0001h
SLRCON_SLRA_LENGTH                       equ 0001h
SLRCON_SLRA_MASK                         equ 0001h
SLRCON_SLRB_POSN                         equ 0001h
SLRCON_SLRB_POSITION                     equ 0001h
SLRCON_SLRB_SIZE                         equ 0001h
SLRCON_SLRB_LENGTH                       equ 0001h
SLRCON_SLRB_MASK                         equ 0002h
SLRCON_SLRC_POSN                         equ 0002h
SLRCON_SLRC_POSITION                     equ 0002h
SLRCON_SLRC_SIZE                         equ 0001h
SLRCON_SLRC_LENGTH                       equ 0001h
SLRCON_SLRC_MASK                         equ 0004h

// Register: ODCON
#define ODCON ODCON
ODCON                                    equ 0F91h
// bitfield definitions
ODCON_U1OD_POSN                          equ 0000h
ODCON_U1OD_POSITION                      equ 0000h
ODCON_U1OD_SIZE                          equ 0001h
ODCON_U1OD_LENGTH                        equ 0001h
ODCON_U1OD_MASK                          equ 0001h
ODCON_U2OD_POSN                          equ 0001h
ODCON_U2OD_POSITION                      equ 0001h
ODCON_U2OD_SIZE                          equ 0001h
ODCON_U2OD_LENGTH                        equ 0001h
ODCON_U2OD_MASK                          equ 0002h
ODCON_CCP1OD_POSN                        equ 0002h
ODCON_CCP1OD_POSITION                    equ 0002h
ODCON_CCP1OD_SIZE                        equ 0001h
ODCON_CCP1OD_LENGTH                      equ 0001h
ODCON_CCP1OD_MASK                        equ 0004h
ODCON_CCP2OD_POSN                        equ 0003h
ODCON_CCP2OD_POSITION                    equ 0003h
ODCON_CCP2OD_SIZE                        equ 0001h
ODCON_CCP2OD_LENGTH                      equ 0001h
ODCON_CCP2OD_MASK                        equ 0008h
ODCON_CCP3OD_POSN                        equ 0004h
ODCON_CCP3OD_POSITION                    equ 0004h
ODCON_CCP3OD_SIZE                        equ 0001h
ODCON_CCP3OD_LENGTH                      equ 0001h
ODCON_CCP3OD_MASK                        equ 0010h
ODCON_CCP4OD_POSN                        equ 0005h
ODCON_CCP4OD_POSITION                    equ 0005h
ODCON_CCP4OD_SIZE                        equ 0001h
ODCON_CCP4OD_LENGTH                      equ 0001h
ODCON_CCP4OD_MASK                        equ 0020h
ODCON_CCP5OD_POSN                        equ 0006h
ODCON_CCP5OD_POSITION                    equ 0006h
ODCON_CCP5OD_SIZE                        equ 0001h
ODCON_CCP5OD_LENGTH                      equ 0001h
ODCON_CCP5OD_MASK                        equ 0040h
ODCON_SSPOD_POSN                         equ 0007h
ODCON_SSPOD_POSITION                     equ 0007h
ODCON_SSPOD_SIZE                         equ 0001h
ODCON_SSPOD_LENGTH                       equ 0001h
ODCON_SSPOD_MASK                         equ 0080h

// Register: TRISA
#define TRISA TRISA
TRISA                                    equ 0F92h
// bitfield definitions
TRISA_TRISA0_POSN                        equ 0000h
TRISA_TRISA0_POSITION                    equ 0000h
TRISA_TRISA0_SIZE                        equ 0001h
TRISA_TRISA0_LENGTH                      equ 0001h
TRISA_TRISA0_MASK                        equ 0001h
TRISA_TRISA1_POSN                        equ 0001h
TRISA_TRISA1_POSITION                    equ 0001h
TRISA_TRISA1_SIZE                        equ 0001h
TRISA_TRISA1_LENGTH                      equ 0001h
TRISA_TRISA1_MASK                        equ 0002h
TRISA_TRISA2_POSN                        equ 0002h
TRISA_TRISA2_POSITION                    equ 0002h
TRISA_TRISA2_SIZE                        equ 0001h
TRISA_TRISA2_LENGTH                      equ 0001h
TRISA_TRISA2_MASK                        equ 0004h
TRISA_TRISA3_POSN                        equ 0003h
TRISA_TRISA3_POSITION                    equ 0003h
TRISA_TRISA3_SIZE                        equ 0001h
TRISA_TRISA3_LENGTH                      equ 0001h
TRISA_TRISA3_MASK                        equ 0008h
TRISA_TRISA5_POSN                        equ 0005h
TRISA_TRISA5_POSITION                    equ 0005h
TRISA_TRISA5_SIZE                        equ 0001h
TRISA_TRISA5_LENGTH                      equ 0001h
TRISA_TRISA5_MASK                        equ 0020h
TRISA_TRISA6_POSN                        equ 0006h
TRISA_TRISA6_POSITION                    equ 0006h
TRISA_TRISA6_SIZE                        equ 0001h
TRISA_TRISA6_LENGTH                      equ 0001h
TRISA_TRISA6_MASK                        equ 0040h
TRISA_TRISA7_POSN                        equ 0007h
TRISA_TRISA7_POSITION                    equ 0007h
TRISA_TRISA7_SIZE                        equ 0001h
TRISA_TRISA7_LENGTH                      equ 0001h
TRISA_TRISA7_MASK                        equ 0080h

// Register: TRISB
#define TRISB TRISB
TRISB                                    equ 0F93h
// bitfield definitions
TRISB_TRISB0_POSN                        equ 0000h
TRISB_TRISB0_POSITION                    equ 0000h
TRISB_TRISB0_SIZE                        equ 0001h
TRISB_TRISB0_LENGTH                      equ 0001h
TRISB_TRISB0_MASK                        equ 0001h
TRISB_TRISB1_POSN                        equ 0001h
TRISB_TRISB1_POSITION                    equ 0001h
TRISB_TRISB1_SIZE                        equ 0001h
TRISB_TRISB1_LENGTH                      equ 0001h
TRISB_TRISB1_MASK                        equ 0002h
TRISB_TRISB2_POSN                        equ 0002h
TRISB_TRISB2_POSITION                    equ 0002h
TRISB_TRISB2_SIZE                        equ 0001h
TRISB_TRISB2_LENGTH                      equ 0001h
TRISB_TRISB2_MASK                        equ 0004h
TRISB_TRISB3_POSN                        equ 0003h
TRISB_TRISB3_POSITION                    equ 0003h
TRISB_TRISB3_SIZE                        equ 0001h
TRISB_TRISB3_LENGTH                      equ 0001h
TRISB_TRISB3_MASK                        equ 0008h
TRISB_TRISB4_POSN                        equ 0004h
TRISB_TRISB4_POSITION                    equ 0004h
TRISB_TRISB4_SIZE                        equ 0001h
TRISB_TRISB4_LENGTH                      equ 0001h
TRISB_TRISB4_MASK                        equ 0010h
TRISB_TRISB5_POSN                        equ 0005h
TRISB_TRISB5_POSITION                    equ 0005h
TRISB_TRISB5_SIZE                        equ 0001h
TRISB_TRISB5_LENGTH                      equ 0001h
TRISB_TRISB5_MASK                        equ 0020h
TRISB_TRISB6_POSN                        equ 0006h
TRISB_TRISB6_POSITION                    equ 0006h
TRISB_TRISB6_SIZE                        equ 0001h
TRISB_TRISB6_LENGTH                      equ 0001h
TRISB_TRISB6_MASK                        equ 0040h
TRISB_TRISB7_POSN                        equ 0007h
TRISB_TRISB7_POSITION                    equ 0007h
TRISB_TRISB7_SIZE                        equ 0001h
TRISB_TRISB7_LENGTH                      equ 0001h
TRISB_TRISB7_MASK                        equ 0080h

// Register: TRISC
#define TRISC TRISC
TRISC                                    equ 0F94h
// bitfield definitions
TRISC_TRISC0_POSN                        equ 0000h
TRISC_TRISC0_POSITION                    equ 0000h
TRISC_TRISC0_SIZE                        equ 0001h
TRISC_TRISC0_LENGTH                      equ 0001h
TRISC_TRISC0_MASK                        equ 0001h
TRISC_TRISC1_POSN                        equ 0001h
TRISC_TRISC1_POSITION                    equ 0001h
TRISC_TRISC1_SIZE                        equ 0001h
TRISC_TRISC1_LENGTH                      equ 0001h
TRISC_TRISC1_MASK                        equ 0002h
TRISC_TRISC2_POSN                        equ 0002h
TRISC_TRISC2_POSITION                    equ 0002h
TRISC_TRISC2_SIZE                        equ 0001h
TRISC_TRISC2_LENGTH                      equ 0001h
TRISC_TRISC2_MASK                        equ 0004h
TRISC_TRISC3_POSN                        equ 0003h
TRISC_TRISC3_POSITION                    equ 0003h
TRISC_TRISC3_SIZE                        equ 0001h
TRISC_TRISC3_LENGTH                      equ 0001h
TRISC_TRISC3_MASK                        equ 0008h
TRISC_TRISC4_POSN                        equ 0004h
TRISC_TRISC4_POSITION                    equ 0004h
TRISC_TRISC4_SIZE                        equ 0001h
TRISC_TRISC4_LENGTH                      equ 0001h
TRISC_TRISC4_MASK                        equ 0010h
TRISC_TRISC5_POSN                        equ 0005h
TRISC_TRISC5_POSITION                    equ 0005h
TRISC_TRISC5_SIZE                        equ 0001h
TRISC_TRISC5_LENGTH                      equ 0001h
TRISC_TRISC5_MASK                        equ 0020h
TRISC_TRISC6_POSN                        equ 0006h
TRISC_TRISC6_POSITION                    equ 0006h
TRISC_TRISC6_SIZE                        equ 0001h
TRISC_TRISC6_LENGTH                      equ 0001h
TRISC_TRISC6_MASK                        equ 0040h
TRISC_TRISC7_POSN                        equ 0007h
TRISC_TRISC7_POSITION                    equ 0007h
TRISC_TRISC7_SIZE                        equ 0001h
TRISC_TRISC7_LENGTH                      equ 0001h
TRISC_TRISC7_MASK                        equ 0080h

// Register: CCPTMRS
#define CCPTMRS CCPTMRS
CCPTMRS                                  equ 0F99h
// bitfield definitions
CCPTMRS_C1TSEL_POSN                      equ 0000h
CCPTMRS_C1TSEL_POSITION                  equ 0000h
CCPTMRS_C1TSEL_SIZE                      equ 0001h
CCPTMRS_C1TSEL_LENGTH                    equ 0001h
CCPTMRS_C1TSEL_MASK                      equ 0001h
CCPTMRS_C2TSEL_POSN                      equ 0001h
CCPTMRS_C2TSEL_POSITION                  equ 0001h
CCPTMRS_C2TSEL_SIZE                      equ 0001h
CCPTMRS_C2TSEL_LENGTH                    equ 0001h
CCPTMRS_C2TSEL_MASK                      equ 0002h
CCPTMRS_C3TSEL_POSN                      equ 0002h
CCPTMRS_C3TSEL_POSITION                  equ 0002h
CCPTMRS_C3TSEL_SIZE                      equ 0001h
CCPTMRS_C3TSEL_LENGTH                    equ 0001h
CCPTMRS_C3TSEL_MASK                      equ 0004h
CCPTMRS_C4TSEL_POSN                      equ 0003h
CCPTMRS_C4TSEL_POSITION                  equ 0003h
CCPTMRS_C4TSEL_SIZE                      equ 0001h
CCPTMRS_C4TSEL_LENGTH                    equ 0001h
CCPTMRS_C4TSEL_MASK                      equ 0008h
CCPTMRS_C5TSEL_POSN                      equ 0004h
CCPTMRS_C5TSEL_POSITION                  equ 0004h
CCPTMRS_C5TSEL_SIZE                      equ 0001h
CCPTMRS_C5TSEL_LENGTH                    equ 0001h
CCPTMRS_C5TSEL_MASK                      equ 0010h

// Register: REFOCON
#define REFOCON REFOCON
REFOCON                                  equ 0F9Ah
// bitfield definitions
REFOCON_RODIV_POSN                       equ 0000h
REFOCON_RODIV_POSITION                   equ 0000h
REFOCON_RODIV_SIZE                       equ 0004h
REFOCON_RODIV_LENGTH                     equ 0004h
REFOCON_RODIV_MASK                       equ 000Fh
REFOCON_ROSEL_POSN                       equ 0004h
REFOCON_ROSEL_POSITION                   equ 0004h
REFOCON_ROSEL_SIZE                       equ 0001h
REFOCON_ROSEL_LENGTH                     equ 0001h
REFOCON_ROSEL_MASK                       equ 0010h
REFOCON_ROSSLP_POSN                      equ 0005h
REFOCON_ROSSLP_POSITION                  equ 0005h
REFOCON_ROSSLP_SIZE                      equ 0001h
REFOCON_ROSSLP_LENGTH                    equ 0001h
REFOCON_ROSSLP_MASK                      equ 0020h
REFOCON_ROON_POSN                        equ 0007h
REFOCON_ROON_POSITION                    equ 0007h
REFOCON_ROON_SIZE                        equ 0001h
REFOCON_ROON_LENGTH                      equ 0001h
REFOCON_ROON_MASK                        equ 0080h
REFOCON_RODIV0_POSN                      equ 0000h
REFOCON_RODIV0_POSITION                  equ 0000h
REFOCON_RODIV0_SIZE                      equ 0001h
REFOCON_RODIV0_LENGTH                    equ 0001h
REFOCON_RODIV0_MASK                      equ 0001h
REFOCON_RODIV1_POSN                      equ 0001h
REFOCON_RODIV1_POSITION                  equ 0001h
REFOCON_RODIV1_SIZE                      equ 0001h
REFOCON_RODIV1_LENGTH                    equ 0001h
REFOCON_RODIV1_MASK                      equ 0002h
REFOCON_RODIV2_POSN                      equ 0002h
REFOCON_RODIV2_POSITION                  equ 0002h
REFOCON_RODIV2_SIZE                      equ 0001h
REFOCON_RODIV2_LENGTH                    equ 0001h
REFOCON_RODIV2_MASK                      equ 0004h
REFOCON_RODIV3_POSN                      equ 0003h
REFOCON_RODIV3_POSITION                  equ 0003h
REFOCON_RODIV3_SIZE                      equ 0001h
REFOCON_RODIV3_LENGTH                    equ 0001h
REFOCON_RODIV3_MASK                      equ 0008h

